app/Models/NewsModel.php

    public function getNews($id = null) {
        if ($id === null) {
            return $this->findAll();
        }



        return $this->asArray()->where(['id' => $id])->first();
---
SELECT *
FROM `news`
WHERE `news`.`deleted_at` IS NULL
SELECT *
FROM `news`
WHERE `id` = '10'
AND `news`.`deleted_at` IS NULL
 LIMIT 1